package lr5;

public class Example6 {
    public static void main(String[] args) {
        Task6 task = new Task6(4, 20);
        task.PrintInt();
        task = new Task6(3);
        task.PrintInt();
        task.Arg(2, 12);
        task.PrintInt();
        task.Arg(-3);
        task.PrintInt();

    }
}
//Напишите программу с классом, в котором есть два закрытых
//целочисленных поля (назовем их max и min). Значение поля max не может
//быть меньше значения поля min. Значения полям присваиваются с помощью
//открытого метода. Метод может вызываться с одним или двумя
//целочисленными аргументами. При вызове метода значения полям
//присваиваются так: сравниваются текущие значения полей и значения
//аргументов, переданных методу. Самое большое из значений присваивается
//полю max, а самое маленькое из значений присваивается полю min.
//Предусмотрите конструктор, который работает по тому же принципу, что и
//метод для присваивания значений полям. В классе также должен быть метод,
//отображающий в консольном окне значения полей объекта